<a href="https://colab.research.google.com/github/juhlianna/Analise-de-dados-com-Python-e-Pandas/blob/main/Pandas_An%C3%A1lise_de_Planilha_Excel.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Trabalhando com Planilhas **Excel**

In [4]:
#Importando a biblioteca
import pandas as pd

In [5]:
#Leitura dos arquivos
df1 = pd.read_excel("Aracaju.xlsx")
df2 = pd.read_excel("Fortaleza.xlsx")
df3 = pd.read_excel("Natal.xlsx")
df4 = pd.read_excel("Recife.xlsx")
df5 = pd.read_excel("Salvador.xlsx")

In [8]:
df1.head(10)

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8
5  Aracaju 2018-01-01  156.20    1522     1
6  Aracaju 2018-01-01   35.50    1522     2
7  Aracaju 2019-01-01  172.22    1522     6
8  Aracaju 2019-01-01   12.16    1523     1
9  Aracaju 2019-01-01  149.36    1523     3

In [9]:
df2.head()

      Cidade       Data  Vendas  LojaID  Qtde
0  Fortaleza 2019-01-01   45.27    1002     2
1  Fortaleza 2019-01-01  115.61    1002     3
2  Fortaleza 2019-02-10   35.33    1004     3
3  Fortaleza 2019-02-10   20.95    1004     6
4  Fortaleza 2019-01-01   14.25    1004     6

In [10]:
df3.head(10)

  Cidade       Data  Vendas  LojaID  Qtde
0  Natal 2018-08-27   606.0     853     2
1  Natal 2018-11-25   563.0     853     2
2  Natal 2019-03-11   308.0     852     3
3  Natal 2019-01-07   271.0     854     3
4  Natal 2019-03-09   699.0     853     3
5  Natal 2019-03-30   674.0     854     2
6  Natal 2018-07-02   322.0     852     4
7  Natal 2019-03-18   886.0     853     4
8  Natal 2019-03-27   667.0     852     4
9  Natal 2018-05-02   261.0     852     3

In [11]:
df4.head()

   Cidade       Data  Vendas  LojaID  Qtde
0  Recife 2019-01-01  162.61     981     1
1  Recife 2019-01-01   11.44     983     1
2  Recife 2019-02-10   12.94     983     5
3  Recife 2019-02-10  160.54     981     3
4  Recife 2019-02-14   19.89     983     7

In [12]:
df5.head(10)

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3
5  Salvador 2019-01-01  179.20    1037     3
6  Salvador 2019-01-01   36.30    1034     2
7  Salvador 2019-02-11    6.13    1034     2
8  Salvador 2019-02-11    4.96    1036     2
9  Salvador 2019-01-01  127.92    1036     1

In [13]:
#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [14]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [15]:
#Exibindo as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [16]:
#Exibindo amostras
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
198      Natal 2019-01-02   13.65    1037     3
71     Aracaju 2018-01-01  228.27    1523     6
193   Salvador 2019-01-02    3.97    1036     2
6        Natal 2018-07-02  322.00     852     4
8    Fortaleza 2019-02-11   37.49    1005     1

In [17]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [18]:
#Alterando o tipo de dado da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [19]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [20]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

In [21]:
#Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [22]:
df.sample(15)

       Cidade       Data  Vendas LojaID  Qtde
14    Aracaju 2018-01-01  148.21   1521     3
184  Salvador 2019-01-02  167.16   1037     1
107   Aracaju 2018-01-01  142.57   1523     3
189  Salvador 2019-01-02  139.73   1037     2
131     Natal 2019-01-02   63.48   1037     3
136     Natal 2019-01-02   13.81   1036     1
68      Natal 2018-06-22  274.00    852     3
74    Aracaju 2018-01-01    7.86   1520     2
179  Salvador 2019-01-02   64.95   1036     1
15    Aracaju 2018-01-01  153.28   1523     6
188  Salvador 2019-01-02  178.11   1035     3
32     Recife 2019-01-01   15.93    982     7
166  Salvador 2019-01-02  111.72   1035     3
156     Natal 2019-01-02   36.14   1037     3
5    Salvador 2019-01-01  179.20   1037     3

In [23]:
df["Vendas"].mean()

122.61180089485438

In [24]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [25]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [26]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [27]:
#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

In [28]:
df.head(10)

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8
5  Aracaju 2018-01-01  156.20   1522     1
6  Aracaju 2018-01-01   35.50   1522     2
7  Aracaju 2019-01-01  172.22   1522     6
8  Aracaju 2019-01-01   12.16   1523     1
9  Aracaju 2019-01-01  149.36   1523     3

In [29]:
df.sample(10)

        Cidade       Data  Vendas LojaID  Qtde
42   Fortaleza 2019-01-01   38.71   1004     5
134      Natal 2019-01-02  125.90   1036     1
205   Salvador 2019-01-02  196.09   1037     1
100   Salvador 2019-01-01  190.97   1036     2
36     Aracaju 2018-01-01   37.99   1523     8
32       Natal 2019-03-17  244.00    854     2
50    Salvador 2019-01-01   44.87   1036     3
84    Salvador 2019-01-01   22.99   1036     1
1     Salvador 2018-01-01   19.02   1034     3
46    Salvador 2019-01-01   34.84   1034     3

In [30]:
#Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [31]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [32]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [33]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [34]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [35]:
#Retornando a menor receita
df["Receita"].min()

3.34

In [36]:
#nlargest melhores receitas
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [37]:
#nsamllest piores receitas
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [38]:
#Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [39]:
#Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0